Repository: JangJaeHyung1/MineSweeper
Catalog: Minesweeper/Utilities/*.lproj/Localizable.strings
Languages: ja, ko, ru, vi, zh_hans, zh_hant

source: Total Mines Found
ja: 総発見地雷数
ko: 총 찾은 지뢰 수
ru: Общее количество найденных мин
vi: Tổng số mìn đã tìm thấy
zh_hans: 找到的地雷总数
zh_hant: 找到的地雷總數

# easyClearCount
source: Easy Mode Clear Count
ja: イージーモードクリア回数
ko: 쉬운 모드 클리어 횟수
ru: Количество завершений в лёгком режиме
vi: Số lần hoàn thành chế độ dễ
zh_hans: 简单模式清除次数
zh_hant: 簡單模式清除次數

# normalClearCount
source: Normal Mode Clear Count
ja: ノーマルモードクリア回数
ko: 보통 모드 클리어 횟수
ru: Количество завершений в нормальном режиме
vi: Số lần hoàn thành chế độ bình thường
zh_hans: 普通模式清除次数
zh_hant: 普通模式清除次數

# hardClearCount
source: Hard Mode Clear Count
ja: ハードモードクリア回数
ko: 어려운 모드 클리어 횟수
ru: Количество завершений в сложном режиме
vi: Số lần hoàn thành chế độ khó
zh_hans: 困难模式清除次数
zh_hant: 困難模式清除次數

# easyBestClearTime
source: Easy Mode Best Record
ja: イージーモード最高記録
ko: 쉬운 모드 최고 기록
ru: Лучший результат в лёгком режиме
vi: Kỷ lục tốt nhất chế độ dễ
zh_hans: 简单模式最佳记录
zh_hant: 簡單模式最佳紀錄

# normalBestClearTime
source: Normal Mode Best Record
ja: ノーマルモード最高記録
ko: 보통 모드 최고 기록
ru: Лучший результат в нормальном режиме
vi: Kỷ lục tốt nhất chế độ thường
zh_hans: 普通模式最佳记录
zh_hant: 普通模式最佳紀錄

# hardBestClearTime
source: Hard Mode Best Record
ja: ハードモード最高記録
ko: 어려운 모드 최고 기록
ru: Лучший результат в сложном режиме
vi: Kỷ lục tốt nhất chế độ khó
zh_hans: 困难模式最佳记录
zh_hant: 困難模式最佳紀錄

source: Total Draws
ja: 総ガチャ回数
ko: 총 뽑기 횟수
ru: Общее количество розыгрышей
vi: Tổng số lần rút thăm
zh_hans: 总抽奖次数
zh_hant: 總抽獎次數

source: Total Points
ja: 累積ポイント
ko: 누적 포인트
ru: Общее количество очков
vi: Tổng điểm
zh_hans: 累计积分
zh_hant: 累積積分

source: Fail Draws
ja: ハズレ回数
ko: 꽝 뽑은 횟수
ru: Количество неудачных розыгрышей
vi: Số lần thất bại
zh_hans: 失败抽奖次数
zh_hant: 失敗抽獎次數

# hiddenPoints
source: ❤️ Hidden 1000 points!
ja: ❤️ 隠された1000ポイントです!!
ko: ❤️ 숨겨진 1000 포인트입니다!!
ru: ❤️ Скрытые 1000 очков!!
vi: ❤️ 1000 điểm ẩn!!
zh_hans: ❤️ 隐藏的1000分!!
zh_hant: ❤️ 隱藏的1000分!!

source: Select Difficulty
ja: 難易度調整
ko: 난이도 조절
ru: Выбрать сложность
vi: Chọn độ khó
zh_hans: 选择难度
zh_hant: 選擇難度

# BetterlucknextTime
source: 😆 Oh no! Better luck next time!
ja: 😆 あっ！終わりましたね！次は頑張ってください！
ko: 😆 앗! 끝났네요! 다음엔 화이팅!
ru: 😆 О нет! Удачи в следующий раз!
vi: 😆 Ôi không! Chúc may mắn lần sau!
zh_hans: 😆 哎呀！下次加油！
zh_hant: 😆 哎呀！下次加油！

# clearTimeFast
source: ⏱️ Clear Time
ja: ⏱️ クリア時間
ko: ⏱️ 클리어 시간
ru: ⏱️ Время завершения
vi: ⏱️ Thời gian hoàn thành
zh_hans: ⏱️ 清除时间
zh_hant: ⏱️ 清除時間

# drawCount
source: 🎰 Draw History
ja: 🎰 ガチャ履歴
ko: 🎰 뽑기 기록
ru: 🎰 История розыгрышей
vi: 🎰 Lịch sử rút thăm
zh_hans: 🎰 抽奖记录
zh_hant: 🎰 抽獎記錄

# foundMine
source: 💣 Mines Found
ja: 💣 発見された地雷
ko: 💣 찾은 지뢰
ru: 💣 Найденные мины
vi: 💣 Số mìn đã tìm thấy
zh_hans: 💣 发现的地雷
zh_hant: 💣 發現的地雷

# gameStatic
source: Game Statistics
ja: ゲーム統計
ko: 게임 통계
ru: Статистика игры
vi: Thống kê trò chơi
zh_hans: 游戏统计
zh_hant: 遊戲統計

# viewRank
source: View Ranking
ja: ランキングを見る
ko: 랭킹 보기
ru: Просмотр рейтинга
vi: Xem xếp hạng
zh_hans: 查看排名
zh_hant: 查看排名

# gameCenterConnected
source: Game Center is already connected
ja: Game Centerは既に連携されています
ko: Game Center가 이미 연동되어있습니다
ru: Game Center уже подключен
vi: Game Center đã được kết nối
zh_hans: Game Center已连接
zh_hant: Game Center已連接

# clearTime
source: All mines found! Time taken: %d seconds
ja: すべての地雷を見つけました！かかった時間: %d秒
ko: 모든 지뢰를 찾았습니다! 걸린 시간: %d초
ru: Все мины найдены! Время выполнения: %d секунд
vi: Đã tìm thấy tất cả mìn! Thời gian hoàn thành: %d giây
zh_hans: 所有地雷已找到！耗时: %d秒
zh_hant: 所有地雷已找到！耗時: %d秒

# getItem
source: 🎉 Item acquired:
ja: 🎉 獲得したアイテム:
ko: 🎉 획득한 아이템:
ru: 🎉 Полученный предмет:
vi: 🎉 Vật phẩm nhận được:
zh_hans: 🎉 获得的物品:
zh_hant: 🎉 獲得的物品:

source: 🏆 Clear Count
ja: 🏆 クリア回数
ko: 🏆 클리어 횟수
ru: 🏆 Количество завершений
vi: 🏆 Số lần hoàn thành
zh_hans: 🏆 清除次数
zh_hant: 🏆 清除次數

# gatchaStart
source: 🛠️ Start Gacha (100 points)
ja: 🛠️ ガチャ開始 (100ポイント)
ko: 🛠️ 뽑기 시작 (100 포인트)
ru: 🛠️ Начать Гача (100 очков)
vi: 🛠️ Bắt đầu Gacha (100 điểm)
zh_hans: 🛠️ 开始抽奖 (100分)
zh_hant: 🛠️ 開始抽獎 (100分)

source: 🥳 Congratulations!
ja: 🥳 おめでとうございます！
ko: 🥳 축하합니다!
ru: 🥳 Поздравляем!
vi: 🥳 Chúc mừng!
zh_hans: 🥳 恭喜！
zh_hant: 🥳 恭喜！

source: Easy
ja: 簡単
ko: 쉬움
ru: Легкий
vi: Dễ
zh_hans: 简单
zh_hant: 簡單

source: Normal
ja: 普通
ko: 보통
ru: Средний
vi: Trung bình
zh_hans: 普通
zh_hant: 普通

source: Hard
ja: 難しい
ko: 어려움
ru: Сложный
vi: Khó
zh_hans: 困难
zh_hant: 困難

# minesweeper
source: Mine Mine
ja: バクバク
ko: 지뢰지뢰
ru: Мина Мина
vi: Mìn Mìn
zh_hans: 地雷地雷
zh_hant: 地雷地雷

source: New Game
ja: 新しいゲーム
ko: 새 게임
ru: Новая игра
vi: Trò chơi mới
zh_hans: 新游戏
zh_hant: 新遊戲

source: OK
ja: 確認
ko: 확인
ru: ОК
zh_hans: 确认
zh_hant: 確認

source: Start Game
ja: ゲーム開始
ko: 게임 시작
ru: Начать игру
vi: Bắt đầu trò chơi
zh_hans: 开始游戏
zh_hant: 開始遊戲
